Revit 2027 API
Form.ProfileCurveLoopCount Property
The number of curve loops in certain profile, specified by profile index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int this[
	int index
] { get; }
Public ReadOnly Property ProfileCurveLoopCount (
	index As Integer
) As Integer
	Get
public:
property int ProfileCurveLoopCount[int index] {
	int get (int index);
}
member ProfileCurveLoopCount : int with get
Parameters
index Int32
Index to specify the profile, should be within 0 and (ProfileCount - 1).
Property Value
Int32
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace